# Pandas

In [26]:
import pandas as pd

In [27]:
# project_path

from dotenv import load_dotenv
import os

# Load environment variables from .env file
load_dotenv()

# Access the PROJECT_PATH variable

In [28]:
manual_dataframe = pd.DataFrame({
    'Current Price' : [223.84, 1970.19, 113.37],
    'Name': ['Apple', 'Amazon', 'Microsoft'],
    'Ticker' : ['AAPL', 'AMZN', 'MSFT']
})

manual_dataframe

   Current Price       Name Ticker
0         223.84      Apple   AAPL
1        1970.19     Amazon   AMZN
2         113.37  Microsoft   MSFT

### Exporting data

In [18]:
manual_dataframe.to_csv(os.path.join(project_path, 'test_dataframe.csv'), index=False)

### Importing data

In [30]:
df_from_csv = pd.read_csv(os.path.join(project_path, 'test_dataframe.csv'))

### View table contents

In [31]:
df_from_csv.head(2)

   Current Price    Name Ticker
0         223.84   Apple   AAPL
1        1970.19  Amazon   AMZN

In [32]:
df_from_csv.tail(2)

   Current Price       Name Ticker
1        1970.19     Amazon   AMZN
2         113.37  Microsoft   MSFT

In [33]:
df_from_csv.shape

(3, 3)